<a href="https://colab.research.google.com/github/MagdaSousa/Estudo_Pandas/blob/master/combinando_dataframe.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [5]:
df1 =pd.DataFrame({'A':['A0','A1','A2','A3'],
                   'B':['B0','B1','B2','B3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']},
                   index =[0,1,2,3])
# o índice 0 será atribuido a linha que contém A0,B0,C0,D0
# o índice 1 será atribuido a linha que contém A1,B1,C1,D1
# o índice 2 será atribuido a linha que contém A2,B2,C2,D2
# o índice 3 será atribuido a linha que contém A3,B3,C3,D3
df1.head()

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [7]:
df2 =pd.DataFrame({'A':['A4','A5','A6','A7'],
                   'B':['B4','B5','B6','B7'],
                   'C':['C4','C5','C6','C7'],
                   'D':['D4','D5','D6','D7']},
                   index =[4,5,6,7])
# o índice 0 será atribuido a linha que contém A4,B4,C4,D4
# o índice 1 será atribuido a linha que contém A5,B5,C5,D5
# o índice 2 será atribuido a linha que contém A6,B6,C6,D6
# o índice 3 será atribuido a linha que contém A7,B7,C7,D7
df2.head()

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [10]:
df3 =pd.DataFrame({'A':['A8','A9','A10','A11'],
                   'B':['B8','B9','B10','B11'],
                   'C':['C8','C9','C10','C11'],
                   'D':['D8','D9','D10','D11']},
                   index =[8,9,10,11])
# o índice 8 será atribuido a linha que contém A8,B9,C10,D11
# o índice 9 será atribuido a linha que contém A8,B9,C10,D11
# o índice 10 será atribuido a linha que contém A8,B9,C10,D11
# o índice 11 será atribuido a linha que contém A8,B9,C10,D11
df3.head()

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [14]:
juntando_os_dataframes =[df1,df2,df3]
juntando_os_dataframes
# gerando uma lista de dataframe, mas feito de uma forma pouco ordenada

[    A   B   C   D
 0  A0  B0  C0  D0
 1  A1  B1  C1  D1
 2  A2  B2  C2  D2
 3  A3  B3  C3  D3,     A   B   C   D
 4  A4  B4  C4  D4
 5  A5  B5  C5  D5
 6  A6  B6  C6  D6
 7  A7  B7  C7  D7,       A    B    C    D
 8    A8   B8   C8   D8
 9    A9   B9   C9   D9
 10  A10  B10  C10  D10
 11  A11  B11  C11  D11]

In [15]:
type(juntando_os_dataframes)

list

In [18]:
frames_combinados= pd.concat(juntando_os_dataframes)
frames_combinados
# peguei a lista com os três  dataframes e juntei no comando concat, para transformar em dataframe

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [17]:
type(frames_combinados)

pandas.core.frame.DataFrame

In [19]:
#ERRO, NÃO COLOCAR DIRETAMENTE OS DATAFRAMES NA FUNÇÃO CONCAT
frames_combinados2 =pd.concat(df1,df2,df3)
frames_combinados2
# pois desta maneira os dataframes estão entrando como argumento

TypeError: ignored

In [20]:
?pd.concat()
#obtendo ajuda em relação a funação

In [21]:
frames_combinados2 =pd.concat([df1,df2,df3])
frames_combinados2
# A maneira correta é sempre colocar os dataframes em um lista dentro da função concat

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [23]:
grupo =pd.concat([df1,df2,df3],keys=['f1','f2','f3'])
grupo
# formo grupos identificados pelas chaves que coloquei no atributo keys

         A    B    C    D
f1 0    A0   B0   C0   D0
   1    A1   B1   C1   D1
   2    A2   B2   C2   D2
   3    A3   B3   C3   D3
f2 4    A4   B4   C4   D4
   5    A5   B5   C5   D5
   6    A6   B6   C6   D6
   7    A7   B7   C7   D7
f3 8    A8   B8   C8   D8
   9    A9   B9   C9   D9
   10  A10  B10  C10  D10
   11  A11  B11  C11  D11

In [24]:
grupo['A']

f1  0      A0
    1      A1
    2      A2
    3      A3
f2  4      A4
    5      A5
    6      A6
    7      A7
f3  8      A8
    9      A9
    10    A10
    11    A11
Name: A, dtype: object

In [25]:
#COLETANDO APENAS OS DADOS DE UM DOS GRUPOS DO DATAFRAME
#localizando o s dados do f2
grupo.loc['f2']

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [26]:
#outra maneira de concatenar
g2 =df1.append(df2)
g2

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [27]:
 g2.append(df3)
 g2

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [29]:
g4 =df1.append(df2).append(df3)
g4

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11